Autodesk.Revit.DB.IFC.IFCAnyHandle.IsSubTypeOf(System.String)
Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
typeName:
The instance type name.
Returns:
True if the instance is an instance of the specified instance type or its subtype, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.IsTypeOf(System.String)
Determines whether the instance is an instance of exactly the specified instance type.
typeName:
The instance type name.
Returns:
True if the instance is an instance of the specified instance type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.UnsetAttribute(System.String)
Unsets the attribute value.
name:
The attribute name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Boolean})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Int32})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Double})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.String})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.IFC.IFCAnyHandle})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Boolean})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Int32})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Double})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.String})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Boolean)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Double)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Int32)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.String)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCData)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.GetAttribute(System.String)
Gets the attribute by name.
name:
The name.
Returns:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.CreateAggregateAttribute(System.String)
Creates an attribute that is an aggregate.
name:
The attribute name.
Returns:
The aggregate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.Unset
Clears the handle.
Since:
2013